podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_RX_DIG_MKW41Z4.svd.xml
            <register>
               <name>AGC_CTRL_0</name>
               <description>AGC Control 0</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>SLOW_AGC_EN</name>
                     <description>Slow AGC Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SLOW_AGC_SRC</name>
                     <description>Slow AGC Source Selection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Access Address match (for active protocol)</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Preamble Detect (for active protocol)</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Fast AGC expire timer</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AGC_FREEZE_EN</name>
                     <description>AGC Freeze Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AGC_FREEZE_PRE_OR_AA</name>
                     <description>AGC Freeze Source Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Access Address match (for active protocol)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Preamble Detect (for active protocol)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AGC_UP_EN</name>
                     <description>AGC Up Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AGC_UP_SRC</name>
                     <description>AGC Up Source</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PDET LO</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>RSSI</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AGC_DOWN_BBA_STEP_SZ</name>
                     <description>AGC_DOWN_BBA_STEP_SZ</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AGC_DOWN_LNA_STEP_SZ</name>
                     <description>AGC_DOWN_LNA_STEP_SZ</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AGC_UP_RSSI_THRESH</name>
                     <description>AGC UP RSSI Threshold</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>AGC_DOWN_RSSI_THRESH</name>
                     <description>AGC DOWN RSSI Threshold</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AGC_CTRL_1</name>
               <description>AGC Control 1</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>BBA_ALT_CODE</name>
                     <description>BBA_ALT_CODE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_ALT_CODE</name>
                     <description>LNA_ALT_CODE</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LNA_USER_GAIN</name>
                     <description>LNA_USER_GAIN</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_USER_GAIN</name>
                     <description>BBA_USER_GAIN</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>USER_LNA_GAIN_EN</name>
                     <description>User LNA Gain Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER_BBA_GAIN_EN</name>
                     <description>User BBA Gain Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRESLOW_EN</name>
                     <description>Pre-slow Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Pre-slow is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Pre-slow is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LNA_GAIN_SETTLE_TIME</name>
                     <description>LNA_GAIN_SETTLE_TIME</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AGC_CTRL_2</name>
               <description>AGC Control 2</description>
               <addressOffset>0xC</addressOffset>
               <resetValue>0xA69000</resetValue>
               <fields>
                  <field>
                     <name>BBA_PDET_RST</name>
                     <description>BBA PDET Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TZA_PDET_RST</name>
                     <description>TZA PDET Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MAN_PDET_RST</name>
                     <description>MAN PDET Reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The peak detector reset signals are controlled automatically by the AGC</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The BBA_PDET_RST and TZA_PDET_RST are used to manually control the peak detector reset signals</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BBA_GAIN_SETTLE_TIME</name>
                     <description>BBA Gain Settle Time</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BBA_PDET_SEL_LO</name>
                     <description>BBA PDET Threshold Low</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>0.600V</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>0.615V</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>0.630V</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>0.645V</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>0.660V</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>0.675V</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>0.690V</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>0.705V</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BBA_PDET_SEL_HI</name>
                     <description>BBA PDET Threshold High</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>0.600V</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>0.795V</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>0.900V</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>0.945V</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>1.005V</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>1.050V</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>1.095V</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>1.155V</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="BBA_PDET_SEL_LO" > <name>TZA_PDET_SEL_LO</name> <description>TZA PDET Threshold Low</description> <bitOffset>18</bitOffset> </field>
                  <field>
                     <name>TZA_PDET_SEL_HI</name>
                     <description>TZA PDET Threshold High</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>0.60V</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>0.63V</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>0.66V</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>0.69V</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>0.72V</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>0.75V</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>0.78V</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>111</name>
                           <description>0.81V</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AGC_FAST_EXPIRE</name>
                     <description>AGC Fast Expire</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>LNA_LG_ON_OVR</name>
                     <description>LNA_LG_ON override</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LNA_HG_ON_OVR</name>
                     <description>LNA_HG_ON override</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AGC_CTRL_3</name>
               <description>AGC Control 3</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>AGC_UNFREEZE_TIME</name>
                     <description>AGC Unfreeze Time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>AGC_PDET_LO_DLY</name>
                     <description>AGC Peak Detect Low Delay</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>AGC_RSSI_DELT_H2S</name>
                     <description>AGC_RSSI_DELT_H2S</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>AGC_H2S_STEP_SZ</name>
                     <description>AGC_H2S_STEP_SZ</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>AGC_UP_STEP_SZ</name>
                     <description>AGC Up Step Size</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AGC_STAT</name>
               <description>AGC Status</description>
               <addressOffset>0x14</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>BBA_PDET_LO_STAT</name>
                     <description>BBA Peak Detector Low Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BBA_PDET_HI_STAT</name>
                     <description>BBA Peak Detector High Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TZA_PDET_LO_STAT</name>
                     <description>TZA Peak Detector Low Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TZA_PDET_HI_STAT</name>
                     <description>TZA Peak Detector High Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CURR_AGC_IDX</name>
                     <description>Current AGC Gain Index</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>AGC_FROZEN</name>
                     <description>AGC Frozen Status</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>AGC is not frozen</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>AGC is frozen</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSSI_ADC_RAW</name>
                     <description>ADC RAW RSSI Reading</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
