podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_RX_DIG_MKW41Z4.svd.xml
            <register>
               <name>RSSI_CTRL_0</name>
               <description>RSSI Control 0</description>
               <addressOffset>0x18</addressOffset>
               <resetValue>0x300000</resetValue>
               <fields>
                  <field>
                     <name>RSSI_USE_VALS</name>
                     <description>RSSI Values Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSSI_HOLD_SRC</name>
                     <description>RSSI Hold Source Selection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Access Address match</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Preamble Detect</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>802.15.4 LQI done (1=freeze, 0=run AGC)</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSSI_HOLD_EN</name>
                     <description>RSSI Hold Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSSI_IIR_CW_WEIGHT</name>
                     <description>RSSI IIR CW Weighting</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Bypass</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1/8</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>1/16</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>1/32</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSSI_N_WINDOW_AVG</name>
                     <description>RSSI N Window Average</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No averaging</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Averaging window length is 2 samples</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>Averaging window length is 4 samples</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>Averaging window length is 8 samples</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSSI_HOLD_DELAY</name>
                     <description>RSSI Hold Delay</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>RSSI_IIR_WEIGHT</name>
                     <description>RSSI IIR Weighting</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Bypass</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1/2</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>1/4</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>1/8</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>1/16</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>1/32</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSSI_VLD_SETTLE</name>
                     <description>RSSI Valid Settle</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RSSI_ADJ</name>
                     <description>RSSI Adjustment</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSSI_CTRL_1</name>
               <description>RSSI Control 1</description>
               <addressOffset>0x1C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RSSI_OUT</name>
                     <description>RSSI Reading</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RSSI_DFT</name>
               <description>RSSI DFT</description>
               <addressOffset>0x20</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DFT_MAG</name>
                     <description>RSSI MAG</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>DFT_NOISE</name>
                     <description>RSSI MAG</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCOC_CTRL_0</name>
               <description>DCOC Control 0</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>DCOC_MIDPWR_TRK_DIS</name>
                     <description>DCOC Mid Power Tracking Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Tracking corrections are enabled as determined by DCOC_CORRECT_SRC and DCOC_TRK_MIN_AGC_IDX</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Tracking corrections are disabled when either the TZA or BBA lo peak detector asserts</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DCOC_MAN</name>
                     <description>DCOC Manual Override</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_TRK_EST_OVR</name>
                     <description>Override for the DCOC tracking estimator</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The tracking estimator is enabled only as needed by the corrector</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The tracking estimator remains enabled whenever the DCOC is active</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DCOC_CORRECT_SRC</name>
                     <description>DCOC Corrector Source</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>If correction is enabled, the DCOC will use only the DCOC calibration table to correct the DC offset</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>If correction is enabled, the DCOC will use the DCOC calibration table and then the tracking estimator to correct the DC offset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DCOC_CORRECT_EN</name>
                     <description>DCOC Correction Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Correction disabled. The DCOC will not correct the DC offset</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Correction enabled. The DCOC will use the TZA and BBA DACs, and apply digital corrections (if DCOC_CORRECT_SRC=1) to correct the DC offset</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRACK_FROM_ZERO</name>
                     <description>Track from Zero</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Track from current I/Q sample</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Track from zero</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BBA_CORR_POL</name>
                     <description>BBA Correction Polarity</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal polarity</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Negative polarity. This should be set if the ADC output is inverted, or if the BBA DACs were implemented with negative polarity</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TZA_CORR_POL</name>
                     <description>TZA Correction Polarity</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal polarity</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Negative polarity. This should be set if the ADC output is inverted, or if the TZA DACs were implemented with negative polarity</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DCOC_CAL_DURATION</name>
                     <description>DCOC Calibration Duration</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_CORR_DLY</name>
                     <description>DCOC Correction Delay</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_CORR_HOLD_TIME</name>
                     <description>DCOC Correction Hold Time</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>127</name>
                           <description>The DC correction is not frozen</description>
                           <value>0b1111111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCOC_CTRL_1</name>
               <description>DCOC Control 1</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>DCOC_SIGN_SCALE_IDX</name>
                     <description>DCOC Sign Scaling</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>1/8</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>1/16</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>1/32</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>1/64</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DCOC_ALPHAC_SCALE_IDX</name>
                     <description>DCOC Alpha-C Scaling</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>1/2</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>1/4</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>1/8</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>1/16</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>1/32</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>1/64</description>
                           <value>0b101</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DCOC_ALPHA_RADIUS_IDX</name>
                     <description>Alpha-R Scaling</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>000</name>
                           <description>1</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>001</name>
                           <description>1/2</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>010</name>
                           <description>1/4</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>011</name>
                           <description>1/8</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>100</name>
                           <description>1/16</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>101</name>
                           <description>1/32</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>110</name>
                           <description>1/64</description>
                           <value>0b110</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DCOC_TRK_EST_GS_CNT</name>
                     <description>DCOC Tracking Estimator Gearshift Count</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field derivedFrom="DCOC_SIGN_SCALE_IDX" > <name>DCOC_SIGN_SCALE_GS_IDX</name> <description>DCOC Sign Scaling for Gearshift</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="DCOC_ALPHAC_SCALE_IDX" > <name>DCOC_ALPHAC_SCALE_GS_IDX</name> <description>DCOC Alpha-C Scaling for Gearshift</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="DCOC_ALPHA_RADIUS_IDX" > <name>DCOC_ALPHA_RADIUS_GS_IDX</name> <description>Alpha-R Scaling for Gearshift</description> <bitOffset>21</bitOffset> </field>
                  <field>
                     <name>DCOC_TRK_MIN_AGC_IDX</name>
                     <description>DCOC Tracking Minimum AGC Table Index</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
