podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_RX_DIG_MKW41Z4.svd.xml
            <register>
               <name>DCOC_DAC_INIT</name>
               <description>DCOC DAC Initialization</description>
               <addressOffset>0x2C</addressOffset>
               <resetValue>0x80802020</resetValue>
               <fields>
                  <field>
                     <name>BBA_DCOC_INIT_I</name>
                     <description>DCOC BBA Init I</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>BBA_DCOC_INIT_Q</name>
                     <description>DCOC BBA Init Q</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TZA_DCOC_INIT_I</name>
                     <description>DCOC TZA Init I</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TZA_DCOC_INIT_Q</name>
                     <description>DCOC TZA Init Q</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCOC_DIG_MAN</name>
               <description>DCOC Digital Correction Manual Override</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>DIG_DCOC_INIT_I</name>
                     <description>DCOC DIG Init I</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>DIG_DCOC_INIT_Q</name>
                     <description>DCOC DIG Init Q</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCOC_CAL_GAIN</name>
               <description>DCOC Calibration Gain</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>DCOC_BBA_CAL_GAIN1</name>
                     <description>DCOC BBA Calibration Gain 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_LNA_CAL_GAIN1</name>
                     <description>DCOC LNA Calibration Gain 1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_BBA_CAL_GAIN2</name>
                     <description>DCOC BBA Calibration Gain 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_LNA_CAL_GAIN2</name>
                     <description>DCOC LNA Calibration Gain 2</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_BBA_CAL_GAIN3</name>
                     <description>DCOC BBA Calibration Gain 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_LNA_CAL_GAIN3</name>
                     <description>DCOC LNA Calibration Gain 3</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCOC_STAT</name>
               <description>DCOC Status</description>
               <addressOffset>0x38</addressOffset>
               <access>read-only</access>
               <resetValue>0x80802020</resetValue>
               <fields>
                  <field>
                     <name>BBA_DCOC_I</name>
                     <description>DCOC BBA DAC I</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>BBA_DCOC_Q</name>
                     <description>DCOC BBA DAC Q</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>TZA_DCOC_I</name>
                     <description>DCOC TZA DAC I</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TZA_DCOC_Q</name>
                     <description>DCOC TZA DAC Q</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCOC_DC_EST</name>
               <description>DCOC DC Estimate</description>
               <addressOffset>0x3C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DC_EST_I</name>
                     <description>DCOC DC Estimate I</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>DC_EST_Q</name>
                     <description>DCOC DC Estimate Q</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCOC_CAL_RCP</name>
               <description>DCOC Calibration Reciprocals</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>DCOC_TMP_CALC_RECIP</name>
                     <description>DCOC Calculation Reciprocal</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>ALPHA_CALC_RECIP</name>
                     <description>Alpha Calculation Reciprocal</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IQMC_CTRL</name>
               <description>IQMC Control</description>
               <addressOffset>0x48</addressOffset>
               <resetValue>0x4008000</resetValue>
               <fields>
                  <field>
                     <name>IQMC_CAL_EN</name>
                     <description>IQ Mismatch Cal Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IQMC_NUM_ITER</name>
                     <description>IQ Mismatch Cal Num Iter</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IQMC_DC_GAIN_ADJ</name>
                     <description>IQ Mismatch Correction DC Gain Coeff</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IQMC_CAL</name>
               <description>IQMC Calibration</description>
               <addressOffset>0x4C</addressOffset>
               <resetValue>0x400</resetValue>
               <fields>
                  <field>
                     <name>IQMC_GAIN_ADJ</name>
                     <description>IQ Mismatch Correction Gain Coeff</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>IQMC_PHASE_ADJ</name>
                     <description>IQ Mismatch Correction Phase Coeff</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LNA_GAIN_VAL_3_0</name>
               <description>LNA_GAIN Step Values 3..0</description>
               <addressOffset>0x50</addressOffset>
               <resetValue>0x3809321D</resetValue>
               <fields>
                  <field>
                     <name>LNA_GAIN_VAL_0</name>
                     <description>LNA_GAIN step 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_VAL_1</name>
                     <description>LNA_GAIN step 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_VAL_2</name>
                     <description>LNA_GAIN step 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_VAL_3</name>
                     <description>LNA_GAIN step 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LNA_GAIN_VAL_7_4</name>
               <description>LNA_GAIN Step Values 7..4</description>
               <addressOffset>0x54</addressOffset>
               <resetValue>0x8B745D4F</resetValue>
               <fields>
                  <field>
                     <name>LNA_GAIN_VAL_4</name>
                     <description>LNA_GAIN step 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_VAL_5</name>
                     <description>LNA_GAIN step 5</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_VAL_6</name>
                     <description>LNA_GAIN step 6</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_VAL_7</name>
                     <description>LNA_GAIN step 7</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LNA_GAIN_VAL_8</name>
               <description>LNA_GAIN Step Values 8</description>
               <addressOffset>0x58</addressOffset>
               <resetValue>0xB6A1</resetValue>
               <fields>
                  <field>
                     <name>LNA_GAIN_VAL_8</name>
                     <description>LNA_GAIN step 8</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_VAL_9</name>
                     <description>LNA_GAIN step 9</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BBA_RES_TUNE_VAL_7_0</name>
               <description>BBA Resistor Tune Values 7..0</description>
               <addressOffset>0x5C</addressOffset>
               <fields>
                  <field>
                     <name>BBA_RES_TUNE_VAL_0</name>
                     <description>BBA Resistor Tune Step 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_VAL_1</name>
                     <description>BBA Resistor Tune Step 1</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_VAL_2</name>
                     <description>BBA Resistor Tune Step 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_VAL_3</name>
                     <description>BBA Resistor Tune Step 3</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_VAL_4</name>
                     <description>BBA Resistor Tune Step 4</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_VAL_5</name>
                     <description>BBA Resistor Tune Step 5</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_VAL_6</name>
                     <description>BBA Resistor Tune Step 6</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_VAL_7</name>
                     <description>BBA Resistor Tune Step 7</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BBA_RES_TUNE_VAL_10_8</name>
               <description>BBA Resistor Tune Values 10..8</description>
               <addressOffset>0x60</addressOffset>
               <fields>
                  <field>
                     <name>BBA_RES_TUNE_VAL_8</name>
                     <description>BBA Resistor Tune Step 8</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_VAL_9</name>
                     <description>BBA Resistor Tune Step 9</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_VAL_10</name>
                     <description>BBA Resistor Tune Step 10</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LNA_GAIN_LIN_VAL_2_0</name>
               <description>LNA Linear Gain Values 2..0</description>
               <addressOffset>0x64</addressOffset>
               <fields>
                  <field>
                     <name>LNA_GAIN_LIN_VAL_0</name>
                     <description>LNA Linear Gain Step 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_LIN_VAL_1</name>
                     <description>LNA Linear Gain Step 1</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_LIN_VAL_2</name>
                     <description>LNA Linear Gain Step 2</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LNA_GAIN_LIN_VAL_5_3</name>
               <description>LNA Linear Gain Values 5..3</description>
               <addressOffset>0x68</addressOffset>
               <fields>
                  <field>
                     <name>LNA_GAIN_LIN_VAL_3</name>
                     <description>LNA Linear Gain Step 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_LIN_VAL_4</name>
                     <description>LNA Linear Gain Step 4</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_LIN_VAL_5</name>
                     <description>LNA Linear Gain Step 5</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LNA_GAIN_LIN_VAL_8_6</name>
               <description>LNA Linear Gain Values 8..6</description>
               <addressOffset>0x6C</addressOffset>
               <fields>
                  <field>
                     <name>LNA_GAIN_LIN_VAL_6</name>
                     <description>LNA Linear Gain Step 6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_LIN_VAL_7</name>
                     <description>LNA Linear Gain Step 7</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_LIN_VAL_8</name>
                     <description>LNA Linear Gain Step 8</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LNA_GAIN_LIN_VAL_9</name>
               <description>LNA Linear Gain Values 9</description>
               <addressOffset>0x70</addressOffset>
               <fields>
                  <field>
                     <name>LNA_GAIN_LIN_VAL_9</name>
                     <description>LNA Linear Gain Step 9</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BBA_RES_TUNE_LIN_VAL_3_0</name>
               <description>BBA Resistor Tune Values 3..0</description>
               <addressOffset>0x74</addressOffset>
               <fields>
                  <field>
                     <name>BBA_RES_TUNE_LIN_VAL_0</name>
                     <description>BBA Resistor Tune Linear Gain Step 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_LIN_VAL_1</name>
                     <description>BBA Resistor Tune Linear Gain Step 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_LIN_VAL_2</name>
                     <description>BBA Resistor Tune Linear Gain Step 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_LIN_VAL_3</name>
                     <description>BBA Resistor Tune Linear Gain Step 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BBA_RES_TUNE_LIN_VAL_7_4</name>
               <description>BBA Resistor Tune Values 7..4</description>
               <addressOffset>0x78</addressOffset>
               <fields>
                  <field>
                     <name>BBA_RES_TUNE_LIN_VAL_4</name>
                     <description>BBA Resistor Tune Linear Gain Step 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_LIN_VAL_5</name>
                     <description>BBA Resistor Tune Linear Gain Step 5</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_LIN_VAL_6</name>
                     <description>BBA Resistor Tune Linear Gain Step 6</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_LIN_VAL_7</name>
                     <description>BBA Resistor Tune Linear Gain Step 7</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BBA_RES_TUNE_LIN_VAL_10_8</name>
               <description>BBA Resistor Tune Values 10..8</description>
               <addressOffset>0x7C</addressOffset>
               <fields>
                  <field>
                     <name>BBA_RES_TUNE_LIN_VAL_8</name>
                     <description>BBA Resistor Tune Linear Gain Step 8</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_LIN_VAL_9</name>
                     <description>BBA Resistor Tune Linear Gain Step 9</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RES_TUNE_LIN_VAL_10</name>
                     <description>BBA Resistor Tune Linear Gain Step 10</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
