podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_RX_DIG_MKW41Z4.svd.xml
            <register>
               <name>AGC_GAIN_TBL_03_00</name>
               <description>AGC Gain Tables Step 03..00</description>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>BBA_GAIN_00</name>
                     <description>BBA Gain 00</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_00</name>
                     <description>LNA Gain 00</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_01</name>
                     <description>BBA Gain 01</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_01</name>
                     <description>LNA Gain 01</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_02</name>
                     <description>BBA Gain 02</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_02</name>
                     <description>LNA Gain 02</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_03</name>
                     <description>BBA Gain 03</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_03</name>
                     <description>LNA Gain 03</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AGC_GAIN_TBL_07_04</name>
               <description>AGC Gain Tables Step 07..04</description>
               <addressOffset>0x84</addressOffset>
               <fields>
                  <field>
                     <name>BBA_GAIN_04</name>
                     <description>BBA Gain 04</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_04</name>
                     <description>LNA Gain 04</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_05</name>
                     <description>BBA Gain 05</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_05</name>
                     <description>LNA Gain 05</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_06</name>
                     <description>BBA Gain 06</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_06</name>
                     <description>LNA Gain 06</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_07</name>
                     <description>BBA Gain 07</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_07</name>
                     <description>LNA Gain 07</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AGC_GAIN_TBL_11_08</name>
               <description>AGC Gain Tables Step 11..08</description>
               <addressOffset>0x88</addressOffset>
               <fields>
                  <field>
                     <name>BBA_GAIN_08</name>
                     <description>BBA Gain 08</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_08</name>
                     <description>LNA Gain 08</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_09</name>
                     <description>BBA Gain 09</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_09</name>
                     <description>LNA Gain 09</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_10</name>
                     <description>BBA Gain 10</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_10</name>
                     <description>LNA Gain 10</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_11</name>
                     <description>BBA Gain 11</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_11</name>
                     <description>LNA Gain 11</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AGC_GAIN_TBL_15_12</name>
               <description>AGC Gain Tables Step 15..12</description>
               <addressOffset>0x8C</addressOffset>
               <fields>
                  <field>
                     <name>BBA_GAIN_12</name>
                     <description>BBA Gain 12</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_12</name>
                     <description>LNA Gain 12</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_13</name>
                     <description>BBA Gain 13</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_13</name>
                     <description>LNA Gain 13</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_14</name>
                     <description>BBA Gain 14</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_14</name>
                     <description>LNA Gain 14</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_15</name>
                     <description>BBA Gain 15</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_15</name>
                     <description>LNA Gain 15</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AGC_GAIN_TBL_19_16</name>
               <description>AGC Gain Tables Step 19..16</description>
               <addressOffset>0x90</addressOffset>
               <fields>
                  <field>
                     <name>BBA_GAIN_16</name>
                     <description>BBA Gain 16</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_16</name>
                     <description>LNA Gain 16</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_17</name>
                     <description>BBA Gain 17</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_17</name>
                     <description>LNA Gain 17</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_18</name>
                     <description>BBA Gain 18</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_18</name>
                     <description>LNA Gain 18</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_19</name>
                     <description>BBA Gain 193</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_19</name>
                     <description>LNA Gain 19</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AGC_GAIN_TBL_23_20</name>
               <description>AGC Gain Tables Step 23..20</description>
               <addressOffset>0x94</addressOffset>
               <fields>
                  <field>
                     <name>BBA_GAIN_20</name>
                     <description>BBA Gain 20</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_20</name>
                     <description>LNA Gain 20</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_21</name>
                     <description>BBA Gain 21</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_21</name>
                     <description>LNA Gain 21</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_22</name>
                     <description>BBA Gain 22</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_22</name>
                     <description>LNA Gain 22</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_23</name>
                     <description>BBA Gain 23</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_23</name>
                     <description>LNA Gain 23</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AGC_GAIN_TBL_26_24</name>
               <description>AGC Gain Tables Step 26..24</description>
               <addressOffset>0x98</addressOffset>
               <fields>
                  <field>
                     <name>BBA_GAIN_24</name>
                     <description>BBA Gain 24</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_24</name>
                     <description>LNA Gain 24</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_25</name>
                     <description>BBA Gain 25</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_25</name>
                     <description>LNA Gain 25</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_GAIN_26</name>
                     <description>BBA Gain 26</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>LNA_GAIN_26</name>
                     <description>LNA Gain 26</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>$(DCOC_OFFSET_COUNT)</dim>
               <dimIncrement>4</dimIncrement>
               <name>DCOC_OFFSET%s</name>
               <description>DCOC Offset</description>
               <addressOffset>0xA0</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>DCOC_BBA_OFFSET_I</name>
                     <description>DCOC BBA I-channel offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_BBA_OFFSET_Q</name>
                     <description>DCOC BBA Q-channel offset</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_TZA_OFFSET_I</name>
                     <description>DCOC TZA I-channel offset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_TZA_OFFSET_Q</name>
                     <description>DCOC TZA Q-channel offset</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCOC_BBA_STEP</name>
               <description>DCOC BBA DAC Step</description>
               <addressOffset>0x10C</addressOffset>
               <fields>
                  <field>
                     <name>BBA_DCOC_STEP_RECIP</name>
                     <description>DCOC BBA Reciprocal of Step Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>BBA_DCOC_STEP</name>
                     <description>DCOC BBA Step Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>11</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10</dimIndex>
               <name>DCOC_TZA_STEP%s</name>
               <description>DCOC TZA DAC Step %s</description>
               <addressOffset>0x110</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>DCOC_TZA_STEP_RCP_0</name>
                     <description>DCOC_TZA_STEP_RCP_0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_TZA_STEP_GAIN_0</name>
                     <description>DCOC_TZA_STEP_GAIN_0</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCOC_CAL_ALPHA</name>
               <description>DCOC Calibration Alpha</description>
               <addressOffset>0x168</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DCOC_CAL_ALPHA_I</name>
                     <description>DCOC Calibration I-channel ALPHA constant</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_CAL_ALPHA_Q</name>
                     <description>DCOC_CAL_ALPHA_Q</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCOC_CAL_BETA_Q</name>
               <description>DCOC Calibration Beta Q</description>
               <addressOffset>0x16C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DCOC_CAL_BETA_Q</name>
                     <description>DCOC_CAL_BETA_Q</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCOC_CAL_BETA_I</name>
               <description>DCOC Calibration Beta I</description>
               <addressOffset>0x170</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DCOC_CAL_BETA_I</name>
                     <description>DCOC_CAL_BETA_I</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCOC_CAL_GAMMA</name>
               <description>DCOC Calibration Gamma</description>
               <addressOffset>0x174</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DCOC_CAL_GAMMA_I</name>
                     <description>DCOC_CAL_GAMMA_I</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_CAL_GAMMA_Q</name>
                     <description>DCOC_CAL_GAMMA_Q</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
