podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_RX_DIG_MKW41Z4.svd.xml
            <register>
               <name>DC_RESID_CTRL</name>
               <description>DC Residual Control</description>
               <addressOffset>0x1D4</addressOffset>
               <fields>
                  <field>
                     <name>DC_RESID_NWIN</name>
                     <description>DC Residual NWIN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>DC_RESID_ITER_FREEZE</name>
                     <description>DC Residual Iteration Freeze</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DC_RESID_ALPHA</name>
                     <description>DC Residual Alpha</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DC_RESID_DLY</name>
                     <description>DC Residual Delay</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>DC_RESID_EXT_DC_EN</name>
                     <description>DC Residual External DC Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DC_RESID_MIN_AGC_IDX</name>
                     <description>DC Residual Minimum AGC Table Index</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>write-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DC_RESID_EST</name>
               <description>DC Residual Estimate</description>
               <addressOffset>0x1D8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DC_RESID_OFFSET_I</name>
                     <description>DC Residual Offset I</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>DC_RESID_OFFSET_Q</name>
                     <description>DC Residual Offset Q</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_RCCAL_CTRL0</name>
               <description>RX RC Calibration Control0</description>
               <addressOffset>0x1DC</addressOffset>
               <fields>
                  <field>
                     <name>BBA_RCCAL_OFFSET</name>
                     <description>BBA RC Calibration value offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RCCAL_MANUAL</name>
                     <description>BBA RC Calibration manual value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RCCAL_DIS</name>
                     <description>BBA RC Calibration Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>BBA RC Calibration is enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>BBA RC Calibration is disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCCAL_SMP_DLY</name>
                     <description>RC Calibration Sample Delay</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>The comp_out signal is sampled 0 clk cycle after sample signal is deasserted</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>The comp_out signal is sampled 1 clk cycle after sample signal is deasserted</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>The comp_out signal is sampled 2 clk cycle after sample signal is deasserted</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>The comp_out signal is sampled 3 clk cycle after sample signal is deasserted</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCCAL_COMP_INV</name>
                     <description>RC Calibration comp_out Invert</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The comp_out signal polarity is NOT inverted</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The comp_out signal polarity is inverted</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TZA_RCCAL_OFFSET</name>
                     <description>TZA RC Calibration value offset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TZA_RCCAL_MANUAL</name>
                     <description>TZA RC Calibration manual value</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TZA_RCCAL_DIS</name>
                     <description>TZA RC Calibration Disable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>TZA RC Calibration is enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TZA RC Calibration is disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_RCCAL_CTRL1</name>
               <description>RX RC Calibration Control1</description>
               <addressOffset>0x1E0</addressOffset>
               <fields>
                  <field>
                     <name>ADC_RCCAL_OFFSET</name>
                     <description>ADC RC Calibration value offset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ADC_RCCAL_MANUAL</name>
                     <description>ADC RC Calibration manual value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>ADC_RCCAL_DIS</name>
                     <description>ADC RC Calibration Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>ADC RC Calibration is enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>ADC RC Calibration is disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BBA2_RCCAL_OFFSET</name>
                     <description>BBA2 RC Calibration value offset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BBA2_RCCAL_MANUAL</name>
                     <description>BBA2 RC Calibration manual value</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>BBA2_RCCAL_DIS</name>
                     <description>BBA2 RC Calibration Disable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>BBA2 RC Calibration is enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>BBA2 RC Calibration is disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_RCCAL_STAT</name>
               <description>RX RC Calibration Status</description>
               <addressOffset>0x1E4</addressOffset>
               <access>read-only</access>
               <resetValue>0x2104210</resetValue>
               <fields>
                  <field>
                     <name>RCCAL_CODE</name>
                     <description>RC Calibration code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>ADC_RCCAL</name>
                     <description>ADC RC Calibration</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>BBA2_RCCAL</name>
                     <description>BBA2 RC Calibration</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>BBA_RCCAL</name>
                     <description>BBA RC Calibration</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>TZA_RCCAL</name>
                     <description>TZA RC Calibration</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AUXPLL_FCAL_CTRL</name>
               <description>Aux PLL Frequency Calibration Control</description>
               <addressOffset>0x1E8</addressOffset>
               <resetValue>0x400000</resetValue>
               <fields>
                  <field>
                     <name>DAC_CAL_ADJUST_MANUAL</name>
                     <description>Aux PLL Frequency DAC Calibration Adjust Manual value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>AUXPLL_DAC_CAL_ADJUST_DIS</name>
                     <description>Aux PLL Frequency Calibration Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Calibration is enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Calibration is disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FCAL_RUN_CNT</name>
                     <description>Aux PLL Frequency Calibration Run Count</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Run count is 256 clock cycles</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Run count is 512 clock cycles</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FCAL_COMP_INV</name>
                     <description>Aux PLL Frequency Calibration Comparison Invert</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>(Default) The comparison associated with the count is not inverted</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The comparison associated with the count is inverted</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FCAL_SMP_DLY</name>
                     <description>Aux PLL Frequency Calibration Sample Delay</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>The count signal is sampled 1 clk cycle after fcal_run signal is deasserted</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>The count signal is sampled 2 clk cycle after fcal_run signal is deasserted</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>The count signal is sampled 3 clk cycle after fcal_run signal is deasserted</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>The count signal is sampled 4 clk cycle after fcal_run signal is deasserted</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DAC_CAL_ADJUST</name>
                     <description>Aux PLL DAC Calibration Adjust value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>AUXPLL_FCAL_CNT6</name>
               <description>Aux PLL Frequency Calibration Count 6</description>
               <addressOffset>0x1EC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FCAL_COUNT_6</name>
                     <description>Aux PLL Frequency Calibration Count 6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>FCAL_BESTDIFF</name>
                     <description>Aux PLL Frequency Calibration Best Difference</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AUXPLL_FCAL_CNT5_4</name>
               <description>Aux PLL Frequency Calibration Count 5 and 4</description>
               <addressOffset>0x1F0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FCAL_COUNT_4</name>
                     <description>Aux PLL Frequency Calibration Count 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>FCAL_COUNT_5</name>
                     <description>Aux PLL Frequency Calibration Count 5</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AUXPLL_FCAL_CNT3_2</name>
               <description>Aux PLL Frequency Calibration Count 3 and 2</description>
               <addressOffset>0x1F4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FCAL_COUNT_2</name>
                     <description>Aux PLL Frequency Calibration Count 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>FCAL_COUNT_3</name>
                     <description>Aux PLL Frequency Calibration Count 3</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AUXPLL_FCAL_CNT1_0</name>
               <description>Aux PLL Frequency Calibration Count 1 and 0</description>
               <addressOffset>0x1F8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FCAL_COUNT_0</name>
                     <description>Frequency Calibration Count 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
                  <field>
                     <name>FCAL_COUNT_1</name>
                     <description>Frequency Calibration Count 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>10</bitWidth>
                  </field>
               </fields>
            </register>
