podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_RX_DIG_MKW41Z4.svd.xml
            <register>
               <name>RXDIG_DFT</name>
               <description>RXDIG DFT</description>
               <addressOffset>0x1FC</addressOffset>
               <fields>
                  <field>
                     <name>DFT_TONE_FREQ</name>
                     <description>DFT Tone Generator Frequency</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>1/64 of the ref osc frequency (500kHz for 32MHz ref osc)</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>1/128 of the ref osc frequency (250kHz for 32MHz ref osc)</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>1/256 of the ref osc frequency (125kHz for 32MHz ref osc)</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>1/512 of the ref osc frequency (62.5kHz for 32MHz ref osc)</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>1/1024 of the ref osc frequency (31.25kHz for 32MHz ref osc)</description>
                           <value>0b100</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DFT_TONE_SCALE</name>
                     <description>DFT Tone Generator Scale</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The DFT tone generator uses 3/4 of the DC offset correction DAC range</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>The DFT tone generator uses 1/2 of the DC offset correction DAC range</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DFT_TONE_TZA_EN</name>
                     <description>DFT Tone Generator TZA Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The DCOC controls the TZA DC offset correction DACs</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A tone is generated using the TZA DC offset correction DACs</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DFT_TONE_BBA_EN</name>
                     <description>DFT Tone Generator BBA Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>The DCOC controls the BBA DC offset correction DACs</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>A tone is generated using the BBA DC offset correction DACs</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
